Revit 2024 API
StairsPath.ShowUpText Property
 Represents whether show stairs up text or not.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool ShowUpText { get; set; }
Visual Basic
Public Property ShowUpText As Boolean
	Get
	Set
Visual C++
public:
property bool ShowUpText {
	bool get ();
	void set (bool value);
}
See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace